backend/vertical-healthcare_ch/forum_datenaustausch_ch.invoice_450_request/src/test/resources/public_examples/streha_invoice_03.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<invoice:request xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:invoice="http://www.forum-datenaustausch.ch/invoice" xsi:schemaLocation="http://www.forum-datenaustausch.ch/invoice generalInvoiceRequest_450.xsd" xmlns="http://www.forum-datenaustausch.ch/invoice" language="de" modus="production" validation_status="0">
    <invoice:processing>
        <invoice:transport from="7601001302112" to="7634567890000">
            <invoice:via via="2000012345678" sequence_id="1"/>
        </invoice:transport>
    </invoice:processing>
    <invoice:payload type="invoice" copy="0" storno="0">
        <invoice:invoice request_timestamp="1619688895" request_date="2021-04-25T00:00:00" request_id="2936699385"/>
        <invoice:body role="hospital" place="hospital">
            <invoice:prolog>
                <invoice:package name="GeneralInvoiceRequestTest" copyright="suva 2000-21" version="100021"/>
                <invoice:generator name="GeneralInvoiceRequestManager 4.50.019" copyright="suva 2000-21" version="450">
                    <invoice:depends_on name="drgValidator ATL Module" copyright="Suva" version="100" id="1007090101"/>
                </invoice:generator>
            </invoice:prolog>
            <invoice:remark>Lorem ipsum per nostra mi fune torectum
                mikonstra.diloru si limus mer fin per od per nostra mi fune torectum mi konstradiloru si limus mer fin itorectum mi konstradiloruko.
            </invoice:remark>
            <invoice:tiers_payant>
                <invoice:biller ean_party="2011234567890" zsr="H121111" uid_number="CHE108791452">
                    <invoice:company>
                        <invoice:companyname>Biller AG</invoice:companyname>
                        <invoice:department>Abteilung Inkasso</invoice:department>
                        <invoice:postal>
                            <invoice:street>Billerweg 128</invoice:street>
                            <invoice:zip>4414</invoice:zip>
                            <invoice:city>Frenkendorf</invoice:city>
                        </invoice:postal>
                        <invoice:telecom>
                            <invoice:phone>061 956 99 00</invoice:phone>
                            <invoice:fax>061 956 99 10</invoice:fax>
                        </invoice:telecom>
                        <invoice:online>
                            <invoice:email>info@biller.ch</invoice:email>
                        </invoice:online>
                    </invoice:company>
                </invoice:biller>
                <invoice:debitor ean_party="7634567890000">
                    <invoice:company>
                        <invoice:companyname>Krankenkasse AG</invoice:companyname>
                        <invoice:department>Sektion Basel</invoice:department>
                        <invoice:postal>
                            <invoice:street>Kassengraben 222</invoice:street>
                            <invoice:zip>4000</invoice:zip>
                            <invoice:city>Basel</invoice:city>
                        </invoice:postal>
                    </invoice:company>
                </invoice:debitor>
                <invoice:provider ean_party="7634567890111" zsr="P123456">
                    <invoice:company>
                        <invoice:companyname>Rehaklinik zur Genesung</invoice:companyname>
                        <invoice:postal>
                            <invoice:street>Spitalgasse 17b5</invoice:street>
                            <invoice:zip statecode="BS">4000</invoice:zip>
                            <invoice:city>Basel</invoice:city>
                        </invoice:postal>
                        <invoice:telecom>
                            <invoice:phone>061 956 99 00</invoice:phone>
                            <invoice:fax>061 956 99 10</invoice:fax>
                        </invoice:telecom>
                    </invoice:company>
                </invoice:provider>
                <invoice:insurance ean_party="7634567890000">
                    <invoice:company>
                        <invoice:companyname>Krankenkasse AG</invoice:companyname>
                        <invoice:department>Sektion Basel</invoice:department>
                        <invoice:postal>
                            <invoice:street>Kassengraben 222</invoice:street>
                            <invoice:zip>4000</invoice:zip>
                            <invoice:city>Basel</invoice:city>
                        </invoice:postal>
                    </invoice:company>
                </invoice:insurance>
                <invoice:patient gender="female" birthdate="2004-02-02T00:00:00" ssn="7561234567890">
                    <invoice:person salutation="Frau">
                        <invoice:familyname>Muster</invoice:familyname>
                        <invoice:givenname>Petra</invoice:givenname>
                        <invoice:postal>
                            <invoice:street>Musterstrasse 5</invoice:street>
                            <invoice:zip>7304</invoice:zip>
                            <invoice:city>Maienfeld</invoice:city>
                        </invoice:postal>
                    </invoice:person>
                    <invoice:card card_id="12345678901234567890" expiry_date="2021-08-01T00:00:00"/>
                </invoice:patient>
                <invoice:guarantor>
                    <invoice:person salutation="Frau">
                        <invoice:familyname>Muster</invoice:familyname>
                        <invoice:givenname>Petra</invoice:givenname>
                        <invoice:postal>
                            <invoice:street>Musterstrasse 5</invoice:street>
                            <invoice:zip>7304</invoice:zip>
                            <invoice:city>Maienfeld</invoice:city>
                        </invoice:postal>
                    </invoice:person>
                </invoice:guarantor>
                <invoice:balance currency="CHF" amount="53199.30" amount_obligations="53199.30" amount_due="53199.30">
                    <invoice:vat vat="0.00" vat_number="CHE108791452">
                        <invoice:vat_rate vat="0.00" vat_rate="0" amount="53199.30"/>
                    </invoice:vat>
                </invoice:balance>
            </invoice:tiers_payant>
            <invoice:esrQR iban="CH0930769016110591261" type="esrQR" reference_number="210000000003139471430009017" customer_note="This is an individuell customer note separated by several lines">
                <invoice:bank>
                    <invoice:company>
                        <invoice:companyname>Bank AG</invoice:companyname>
                        <invoice:department>Abteilung VESR</invoice:department>
                        <invoice:postal>
                            <invoice:zip countrycode="CH">4002</invoice:zip>
                            <invoice:city>Basel</invoice:city>
                        </invoice:postal>
                    </invoice:company>
                </invoice:bank>
                <invoice:creditor>
                    <invoice:company>
                        <invoice:companyname>CreditorenAllianz beider Basel</invoice:companyname>
                        <invoice:department>GmbH &amp; Co KG</invoice:department>
                        <invoice:postal>
                            <invoice:street>Billerweg 128</invoice:street>
                            <invoice:zip countrycode="CH">4414</invoice:zip>
                            <invoice:city>Frenkendorf</invoice:city>
                        </invoice:postal>
                    </invoice:company>
                </invoice:creditor>
            </invoice:esrQR>
            <invoice:kvg case_id="123456-6789" case_date="2021-04-25T00:00:00" insured_id="123.45.678-012"/>
            <invoice:treatment date_begin="2021-02-10T09:00:00" date_end="2021-04-23T09:00:00" canton="BS" reason="disease" apid="stRehaID_1456" acid="Reha005.4">
                <invoice:diagnosis type="ICD" code="M00.10">Arthritis und Polyarthritis durch Pneumokokken: Mehrere Lokalisationen</invoice:diagnosis>
                <invoice:xtra_hospital>
                    <invoice:stationary section_major="M00" hospitalization_type="regular" hospitalization_mode="noncantonal_indicated" class="general" treatment_days="P73D" hospitalization_date="2021-02-10T09:00:00" has_expense_loading="0">
                        <invoice:admission_type number="0" name="normal"/>
                        <invoice:discharge_type number="0" name="normal"/>
                        <invoice:provider_type number="3" name="Rehabilitationsklinik"/>
                        <invoice:bfs_residence_before_admission code="1" name="Zuhause"/>
                        <invoice:bfs_admission_type code="3" name="angemeldet, geplant"/>
                        <invoice:bfs_decision_for_discharge code="1" name="auf Initiative des Behandelnden"/>
                        <invoice:bfs_residence_after_discharge code="1" name="Zuhause"/>
                    </invoice:stationary>
                </invoice:xtra_hospital>
            </invoice:treatment>
            <invoice:services>
                <invoice:service record_id="1" tariff_type="020" code="TR11A" session="1" quantity="1" date_begin="2021-02-10T00:00:00" date_end="2021-04-23T00:00:00" provider_id="7634567890111" responsible_id="7634567890333" unit="141.264" unit_factor="759" external_factor="0.49" amount="52537.49" service_attributes="0" obligation="1"
                                 name="Rehabilitation für Kinder und Jugendliche, Alter kleiner 19 Jahre, mit komplizierender Diagnose" section_code="M00"/>
                <invoice:service record_id="2" tariff_type="011" code="ZE-2021-47.12" session="1" quantity="1" date_begin="2021-02-14T00:00:00" provider_id="7634567890111" responsible_id="7634567890333" unit="1350.64" unit_factor="1" external_factor="0.49" amount="661.81" service_attributes="0" obligation="1" name="Tocilizumab, intravenös, 560 mg bis unter 720 mg"/>
            </invoice:services>
        </invoice:body>
    </invoice:payload>
</invoice:request>

